public class Main_Class {
    //Создали пустой main класс

/*    1. Необходимо написать два метода, которые делают следующее:
            1) Создают одномерный длинный массив, например:
    static final int size = 10000000;
2) Заполняют этот массив единицами;
3) Засекают время выполнения: long a = System.currentTimeMillis();
4) Проходят по всему массиву и для каждой ячейки считают новое значение по формуле:
    arr[i] = (float)(arr[i] * Math.sin(0.2f + i / 5) * Math.cos(0.2f + i / 5) * Math.cos(0.4f + i / 2));
5) Проверяется время окончания метода System.currentTimeMillis();
6) В консоль выводится время работы: System.out.println(System.currentTimeMillis() - a);
    Отличие первого метода от второго:
    Первый просто бежит по массиву и вычисляет значения.
    Второй разбивает массив на два массива, в двух потоках высчитывает новые значения и потом склеивает эти массивы
    братно в один.
    Для второго метода замеряете время разбивки массива на 2, просчета каждого из двух массивов и склейки.*/

    public static void main(String[] args) {
        System.out.println("Время работы единого моноМетода = " + MethodsRacing.TestMonoStreamMethod() + " милисекунд");
        try {
            System.out.println("Время работы Метода в 2 потока = " + MethodsRacing.Test2StreamsMethod() + " милисекунд");
        } catch (InterruptedException e){
            System.out.println("Исключение возникло при ожидании выполнения потоков");
        }

    }
}
