import java.io.IOException;
import java.net.ServerSocket;

/*1. Написать консольный вариант клиент\серверного приложения, в котором пользователь может писать сообщения, как на
клиентской стороне, так и на серверной. Т.е. если на клиентской стороне написать "Привет", нажать Enter то сообщение
 должно передаться на сервер и там отпечататься в консоли. Если сделать то же самое на серверной стороне, сообщение
  соответственно передается клиенту и печатается у него в консоли. Есть одна особенность, которую нужно учитывать:
   клиент или сервер может написать несколько сообщений подряд, такую ситуацию необходимо корректно обработать
        разобраться с кодом с занятия, он является фундаментом проекта-чата
        ВАЖНО! Сервер общается только с одним клиентом, т.е. не нужно запускать цикл, который будет ожидать
        второго/третьего/n-го клиентов*/

public class ServerApi {

    public static void main(String[] args) {
        ServerChat.serverInputListener();
        while (true) {  //Внешний цикл постоянной работы сервера. Если соединение прервано, мы готовы наладить новое
            //переходим в режим ввода сообщений с консоли сервера (создаем поток, постоянно читающий консоль)
            //ServerChat.serverInputListener();
            //откроем соединение и подготовим сокет
            try (ServerSocket serverSocket = new ServerSocket(8181)) {
                ServerChat.acceptClientConnection(serverSocket);
            } catch (IOException e) {
                e.printStackTrace();
            }
        }

    }

}
