
import ServerChatPackage.MyServer;



/* По сравнению с версией из ДЗ №7 добавлены возможности:
     1. При захождении/выходе из чата клиентов оповещаются автоматически весь список присутствующих в этом чате.
     2. Все системные("/команда") команды от клиента (и от сервера тоже) теперь находятся в едином блоке switch/case.
     3. Клиент теперь реагирует на внесистемные/некорректные отключение сервера (как и сервер реагировал на отключения клиента).
     4. Клиенту сообщается при авторизации ещё и тот ник, под которым он авторизовался (или пытался авторизоваться).
     5. Реализовано отключение неавторизованных пользователей по времени (120 сек).
 */
public class ServerApi {

    public static void main(String[] args) {
        new MyServer();

    }

}
